<?php    
    $prazdniki = [
            "2023.01.10" => "первый",
             "2023.01.11" =>"второй",
             "2023.01.12" =>"третий",
             "2023.01.13" =>"четвертый",
             "2023.01.14" =>"пятый",
             "2023.01.25" =>"шестой",
             "2023.01.26" =>"седьмой",
             "2023.01.27" =>"восьмой",
             "2023.01.28" =>"девятый",
             "2023.01.29" =>"десятый",
            ];
        $t = date("Y.m.d");
        echo "<h1>Сегодня ".$prazdniki[$t].", Поздравляем вас с этим праздником</h1>";
?>